Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/leaving_certificate_vocational_programme.html.txt.tmx
Source language: en
Languages: ga

source: Ireland's Leaving Certificate Vocational Programme is a Leaving Certificate with a strong vocational aspect
ga: Séard atá i nGairmchlár na hArdteistiméireachta ná Ardteistiméireacht le dreach láidir ghairmiúil

source: The programme consists of Leaving Certificate subjects, together with three compulsory link modules on enterprise education, preparation for work and work experience
ga: Tá ábhair na hArdteistiméireachta sa chlár, in éineacht le trí mhódúil nascaithe éigeantach, ar Oideachas Fiontair, Ullmhú Oibre agus Taithí Oibre

source: Students must take at least 5 Leaving Certificate subjects, one of which must be Irish and a continental language or vocational language module
ga: Caithfidh scoláirí 5 ábhar Ard-Teiste a bheith acu ar a laghad, Gaeilge a bheith mar cheann acu agus teanga iasachta nó módúl de theanga ghairmiúil

source: The link modules are activity-based
ga: Tá na módúil nascaithe bunaithe ar ghníomhaíocht

source: They usually take a total of 2 to 3 class periods per week, compared with a Leaving Certificate subject, which generally takes 4 to 5 class periods in a week
ga: Is iondúil go dtógann siad 2 nó 3 ranganna gach seachtain, i gcomparáid le ábhar Ardteistiméireachta a thógann 4 go 5 de ranganna sa tseachtain

source: The subject groupings put regular Leaving Certificate subjects that complement each other into groupings
ga: Cuirtear gnáth-ábhair na hArdteistiméireachta a oireann dá chéile i ngrúpaí

source: There are 2 groupings:
ga: Tá dhá ghrúpa ann:

source: • Specialist groupings, in which the subject content of each subject is helpful to the other,
ga: • Grúpa speisialta, ina bhfuil eolas faoi ábhar amháin ag cabhrú leis an gceann eile,

source: • Services groupings, where the subjects might work well together from a business or commercial point of view
ga: • Grúpa seirbhísí, ina n-oibríonn na hábhair go maith le chéile ó thaobh gnó nó tradáil de, b'fhéidir

source: Students must take 2 subjects from these groupings
ga: Caithfidh scoláirí dhá ábhar a dhéanamh as an dá ghrúpa

source: The Leaving Certificate subjects are examined through the standard Leaving Certificate examination
ga: Scrúdaítear na hábhair trí ghnáth-scrúdú na hArdteistiméireachta

source: The link modules are assessed in a written examination representing 40% of total marks and a portfolio of coursework representing 60% of total marks
ga: Meastar na módúil nascaithe trí scrúdú scríofa a léiríonn 40% de na marcanna iomlána agus cuntas ar chúrsa oibre a léiríonn 60% de na marcanna iomlána

source: Students receive the same certificate as other Leaving Certificate students, but their Leaving Certificate includes an additional statement of the results of the link modules (pass, merit or distinction)
ga: Fáigheann scoláirí an teastas céanna is a fháigheann scoláirí na hArdteistiméireachta, ach bíonn ráiteas eile sa Teastas faoi thoradh na módúil nascaithe (Pas, Fiúntas nó Gradam)

source: Access to further study with the Leaving Certificate Vocational Programme
ga: Slí chuig staidéar níos airde le Gairmchlár na hArdteistiméireachta

source: The programme gives students the same opportunity to proceed to universities and colleges as the students taking the Established Leaving Certificate
ga: Tugann an clár an deis chéanna do mhic léinn dul go dtí ollscoilanna agus coláistí agus a dhéanann an Ardteistiméireacht Bhunaithe

source: There is a new grading scheme for the Leaving Certificate in 2017
ga: Tá scéim grádaithe nua don Ardteist i 2017

source: The new scheme means that the Common Points Scale used by the CAO to determine entry into higher education institutions, has also been revised
ga: Ciallaíonn an scéim nua go ndearnadh leasú ar an Scála Pointí Comónta a úsáideann an CAO chun iontráil ar institiúidí tríú leibhéil a mheas

source: From 2017, Institutes of Technology and the universities recognise the link modules as follows:
ga: Ó 2017, aithníonn na hInstitiúidí Teicneolaíochta agus na hollscoileanna na modúil naisc mar seo a leanas:

source: You can read more on transition.ie
ga: Is féidir a thuilleadh a léamh anseo transition.ie

source: The fee for entry for school-based students of the Leaving Certificate Vocational Programme for 2017 is €116
ga: Is é €116 an táille iontrála don bhliain 2017 do mhic léinn scoile de chuid Ghairmchlár na hArdteistiméireachta

source: You can get further information on state examination fees
ga: Tá tuilleadh eolais faoi tháillí scrúduithe Stáit ar fáil anseo

source: Candidates who hold a current medical card or who are dependent on a parent or guardian who holds a current medical card are exempt from paying examination fees
ga: Tá iarrthóirí a bhfuil cárta leighis reatha acu nó gur chleithiúnaithe iad de chuid tuismitheora nó caomhnóra a bhfuil cárta leighis reatha aige nó aici díolmhaithe ó tháillí scrúduithe a íoc

source: Applicants who are claiming exemption from fees on this basis must provide medical card details to the Commission
ga: Ní foláir d’iarratasóirí a bhfuil díolúine ó tháillí á héileamh acu ar an mbonn sin sonraí maidir leis an gcárta leighis a sholáthar don Choimisiún

source: Applications from external candidates received after 8 February 2017 are subject to late fees even if the initial fee has been waived
ga: Tá iarratais ó iarrthóirí seachtracha a fhaightear tar éis 8 Feabhra 2017 faoi réir táillí deireanacha a íoc fiú má rinneadh an táille thosaigh a tharscaoileadh

source: If you are a post-primary school student, your details will be sent to the State Examinations Commission by your school
ga: Más scoláire thú atá ar freastal ar scoil dara leibhéil, cuirfidh an scoil do chuid sonraí chuig Coimisiún na Scrúduithe Stáit

source: If you are an external (non-school) candidate for the Leaving Certificate Vocational Programme, you can apply online or on the application form available from the State Examinations Commission
ga: Más iarrthóir seachtrach thú (nach bhfuil ag freastal ar scoil) don Chúrsa Gairmiúil Ardteistiméireachta, ba chóir d’iarratas ar líne nó i scríbhinn dhéanamh agus a bheith curtha chuig Coimisiún na Scrúduithe Stáit faoin dáta deiridh

source: You can find the timetable for the practical portion of the Leaving Certificate Vocational Programme here (pdf)
ga: Tá Clár Gairme na hArdteistiméireachta, Sceideal Dátaí Scrúduithe (pdf) le feiceáil
